In [1]:
#import the pandas  library  and  aliasing  as  ps
import pandas as pd

In [2]:
df=pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
data=[1,2,4,5,6]

In [5]:
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  4
3  5
4  6

In [6]:
data=[['Ram',30],['Manish',27],['Hari',44]]
df=pd.DataFrame(data,columns=['Name','Age'])

In [7]:
df

     Name  Age
0     Ram   30
1  Manish   27
2    Hari   44

In [8]:
 my_dict={'name':['paras','sarad','subash'],'age':[29,32,34],'runs':[163,300,766]}

In [9]:
df=pd.DataFrame(my_dict)

In [10]:
df

   age    name  runs
0   29   paras   163
1   32   sarad   300
2   34  subash   766

In [11]:
#for  rename  columns
df=df.rename(columns={'age':'renamed age'})

In [12]:
df

   renamed age    name  runs
0           29   paras   163
1           32   sarad   300
2           34  subash   766

In [13]:
#for  delete columns
del df['runs']

In [14]:
df

   renamed age    name
0           29   paras
1           32   sarad
2           34  subash